; RUN: opt %dfsan -S < %s 2> /dev/null | llc %llcparams - -o %t1 && clang++ %link %t1 -o %t2 && echo 10 | %execparams %t2 10 > %t2.json && diff -w %s.json %t2.json
; RUN: %jsonconvert %s.json 2> /dev/null | diff -w %s.processed.json -
; ModuleID = 'tests/dfsan-unit/prune.cpp'
source_filename = "tests/dfsan-unit/prune.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::__1::basic_istream" = type { i32 (...)**, i64, %"class.std::__1::basic_ios.base" }
%"class.std::__1::basic_ios.base" = type <{ %"class.std::__1::ios_base", %"class.std::__1::basic_ostream"*, i32 }>
%"class.std::__1::ios_base" = type { i32 (...)**, i32, i64, i64, i32, i32, i8*, i8*, void (i32, %"class.std::__1::ios_base"*, i32)**, i32*, i64, i64, i64*, i64, i64, i8**, i64, i64 }
%"class.std::__1::basic_ostream" = type { i32 (...)**, %"class.std::__1::basic_ios.base" }

$_Z17register_variableIiEvPT_PKc = comdat any

$_Z17register_variableIdEvPT_PKc = comdat any

@global = dso_local global i32 100, align 4, !dbg !0
@global2 = dso_local global double 3.140000e+00, align 8, !dbg !18
@.str = private unnamed_addr constant [7 x i8] c"extrap\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [27 x i8] c"tests/dfsan-unit/prune.cpp\00", section "llvm.metadata"
@_ZNSt3__13cinE = external dso_local global %"class.std::__1::basic_istream", align 8
@.str.2 = private unnamed_addr constant [3 x i8] c"x1\00", align 1

!296 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !297, file: !42, line: 505)
!297 = !DISubprogram(name: "llrintl", scope: !57, file: !57, line: 316, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!298 = !DISubroutineType(types: !299)
!299 = !{!157, !41}
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !301, file: !42, line: 506)
!301 = !DISubprogram(name: "llroundl", scope: !57, file: !57, line: 322, type: !298, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !303, file: !42, line: 507)
!303 = !DISubprogram(name: "log1pl", scope: !57, file: !57, line: 122, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!304 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !305, file: !42, line: 508)
!305 = !DISubprogram(name: "log2l", scope: !57, file: !57, line: 133, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!306 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !307, file: !42, line: 509)
!307 = !DISubprogram(name: "logbl", scope: !57, file: !57, line: 125, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!308 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !309, file: !42, line: 510)
!309 = !DISubprogram(name: "lrintl", scope: !57, file: !57, line: 314, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!310 = !DISubroutineType(types: !311)
!311 = !{!26, !41}
!312 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !313, file: !42, line: 511)
!313 = !DISubprogram(name: "lroundl", scope: !57, file: !57, line: 320, type: !310, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !315, file: !42, line: 512)
!315 = !DISubprogram(name: "nanl", scope: !57, file: !57, line: 201, type: !316, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!316 = !DISubroutineType(types: !317)
!317 = !{!41, !176}
!318 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !319, file: !42, line: 513)
!319 = !DISubprogram(name: "nearbyintl", scope: !57, file: !57, line: 294, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!320 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !321, file: !42, line: 514)
!321 = !DISubprogram(name: "nextafterl", scope: !57, file: !57, line: 259, type: !218, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!322 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !323, file: !42, line: 515)
!323 = !DISubprogram(name: "nexttowardl", scope: !57, file: !57, line: 261, type: !218, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !325, file: !42, line: 516)
!325 = !DISubprogram(name: "remainderl", scope: !57, file: !57, line: 272, type: !218, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !327, file: !42, line: 517)
!327 = !DISubprogram(name: "remquol", scope: !57, file: !57, line: 307, type: !328, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!328 = !DISubroutineType(types: !329)
!329 = !{!41, !41, !41, !86}
!330 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !331, file: !42, line: 518)
!331 = !DISubprogram(name: "rintl", scope: !57, file: !57, line: 256, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !333, file: !42, line: 519)
!333 = !DISubprogram(name: "roundl", scope: !57, file: !57, line: 298, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !335, file: !42, line: 520)
!335 = !DISubprogram(name: "scalblnl", scope: !57, file: !57, line: 290, type: !336, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!336 = !DISubroutineType(types: !337)
!337 = !{!41, !41, !26}
!338 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !339, file: !42, line: 521)
!339 = !DISubprogram(name: "scalbnl", scope: !57, file: !57, line: 276, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!340 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !341, file: !42, line: 522)
!341 = !DISubprogram(name: "tgammal", scope: !57, file: !57, line: 235, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !343, file: !42, line: 523)
!343 = !DISubprogram(name: "truncl", scope: !57, file: !57, line: 302, type: !53, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !29, file: !345, line: 99)
!345 = !DIFile(filename: "build_tool/../usr/include/c++/v1/cstdlib", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !347, file: !345, line: 100)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !348, line: 62, baseType: !349)
!348 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!349 = !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !351, file: !345, line: 101)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !348, line: 70, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !353, identifier: "_ZTS6ldiv_t")
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !352, file: !348, line: 68, baseType: !26, size: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !352, file: !348, line: 69, baseType: !26, size: 64, offset: 64)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !357, file: !345, line: 103)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !348, line: 80, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !348, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !359, identifier: "_ZTS7lldiv_t")
!359 = !{!360, !361}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !358, file: !348, line: 78, baseType: !157, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !358, file: !348, line: 79, baseType: !157, size: 64, offset: 64)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !363, file: !345, line: 105)
!363 = !DISubprogram(name: "atof", scope: !364, file: !364, line: 25, type: !174, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!364 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !366, file: !345, line: 106)
!366 = distinct !DISubprogram(name: "atoi", scope: !348, file: !348, line: 361, type: !367, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !369)
!367 = !DISubroutineType(types: !368)
!368 = !{!7, !176}
!369 = !{!370}
!370 = !DILocalVariable(name: "__nptr", arg: 1, scope: !366, file: !348, line: 361, type: !176)
!371 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !372, file: !345, line: 107)
!372 = !DISubprogram(name: "atol", scope: !348, file: !348, line: 366, type: !373, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!373 = !DISubroutineType(types: !374)
!374 = !{!26, !176}
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !376, file: !345, line: 109)
!376 = !DISubprogram(name: "atoll", scope: !348, file: !348, line: 373, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!377 = !DISubroutineType(types: !378)
!378 = !{!157, !176}
!379 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !380, file: !345, line: 111)
!380 = !DISubprogram(name: "strtod", scope: !348, file: !348, line: 117, type: !381, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!381 = !DISubroutineType(types: !382)
!382 = !{!6, !383, !384}
!383 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !176)
!384 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !8)
!385 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !386, file: !345, line: 112)
!386 = !DISubprogram(name: "strtof", scope: !348, file: !348, line: 123, type: !387, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!387 = !DISubroutineType(types: !388)
!388 = !{!48, !383, !384}
!389 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !390, file: !345, line: 113)
!390 = !DISubprogram(name: "strtold", scope: !348, file: !348, line: 126, type: !391, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!391 = !DISubroutineType(types: !392)
!392 = !{!41, !383, !384}
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !394, file: !345, line: 114)
!394 = !DISubprogram(name: "strtol", scope: !348, file: !348, line: 176, type: !395, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!395 = !DISubroutineType(types: !396)
!396 = !{!26, !383, !384, !7}
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !398, file: !345, line: 116)
!398 = !DISubprogram(name: "strtoll", scope: !348, file: !348, line: 200, type: !399, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!399 = !DISubroutineType(types: !400)
!400 = !{!157, !383, !384, !7}
!401 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !402, file: !345, line: 118)
!402 = !DISubprogram(name: "strtoul", scope: !348, file: !348, line: 180, type: !403, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!403 = !DISubroutineType(types: !404)
!404 = !{!30, !383, !384, !7}
!405 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !406, file: !345, line: 120)
!406 = !DISubprogram(name: "strtoull", scope: !348, file: !348, line: 205, type: !407, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!407 = !DISubroutineType(types: !408)
!408 = !{!409, !383, !384, !7}
!409 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !411, file: !345, line: 122)
!411 = !DISubprogram(name: "rand", scope: !348, file: !348, line: 453, type: !412, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DISubroutineType(types: !413)
!413 = !{!7}
!414 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !415, file: !345, line: 123)
!415 = !DISubprogram(name: "srand", scope: !348, file: !348, line: 455, type: !416, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!419 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !420, file: !345, line: 124)
!420 = !DISubprogram(name: "calloc", scope: !348, file: !348, line: 541, type: !421, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!421 = !DISubroutineType(types: !422)
!422 = !{!423, !29, !29}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !425, file: !345, line: 125)
!425 = !DISubprogram(name: "free", scope: !348, file: !348, line: 563, type: !426, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !423}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !429, file: !345, line: 126)
!429 = !DISubprogram(name: "malloc", scope: !348, file: !348, line: 539, type: !430, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!430 = !DISubroutineType(types: !431)
!431 = !{!423, !29}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !433, file: !345, line: 127)
!433 = !DISubprogram(name: "realloc", scope: !348, file: !348, line: 549, type: !434, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!423, !423, !29}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !437, file: !345, line: 128)
!437 = !DISubprogram(name: "abort", scope: !348, file: !348, line: 588, type: !438, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{null}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !441, file: !345, line: 129)
!441 = !DISubprogram(name: "atexit", scope: !348, file: !348, line: 592, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DISubroutineType(types: !443)
!443 = !{!7, !444}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !446, file: !345, line: 130)
!446 = !DISubprogram(name: "exit", scope: !348, file: !348, line: 614, type: !447, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !7}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !450, file: !345, line: 131)
!450 = !DISubprogram(name: "_Exit", scope: !348, file: !348, line: 626, type: !447, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !452, file: !345, line: 133)
!452 = !DISubprogram(name: "getenv", scope: !348, file: !348, line: 631, type: !453, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!453 = !DISubroutineType(types: !454)
!454 = !{!9, !176}
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !456, file: !345, line: 134)
!456 = !DISubprogram(name: "system", scope: !348, file: !348, line: 781, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !458, file: !345, line: 136)
!458 = !DISubprogram(name: "bsearch", scope: !459, file: !459, line: 20, type: !460, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!460 = !DISubroutineType(types: !461)
!461 = !{!423, !462, !462, !29, !29, !464}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !348, line: 805, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DISubroutineType(types: !467)
!467 = !{!7, !462, !462}
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !469, file: !345, line: 137)
!469 = !DISubprogram(name: "qsort", scope: !348, file: !348, line: 827, type: !470, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !423, !29, !29, !464}
!472 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !52, file: !345, line: 138)
!473 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !474, file: !345, line: 139)
!474 = !DISubprogram(name: "labs", scope: !348, file: !348, line: 838, type: !475, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!475 = !DISubroutineType(types: !476)
!476 = !{!26, !26}
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !478, file: !345, line: 141)
!478 = !DISubprogram(name: "llabs", scope: !348, file: !348, line: 841, type: !479, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!479 = !DISubroutineType(types: !480)
!480 = !{!157, !157}
!481 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !482, file: !345, line: 143)
!482 = !DISubprogram(name: "div", linkageName: "_Z3divxx", scope: !37, file: !37, line: 808, type: !483, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!483 = !DISubroutineType(types: !484)
!484 = !{!357, !157, !157}
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !486, file: !345, line: 144)
!486 = !DISubprogram(name: "ldiv", scope: !348, file: !348, line: 851, type: !487, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!487 = !DISubroutineType(types: !488)
!488 = !{!351, !26, !26}
!489 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !490, file: !345, line: 146)
!490 = !DISubprogram(name: "lldiv", scope: !348, file: !348, line: 855, type: !483, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !492, file: !345, line: 148)
!492 = !DISubprogram(name: "mblen", scope: !348, file: !348, line: 919, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DISubroutineType(types: !494)
!494 = !{!7, !176, !29}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !496, file: !345, line: 149)
!496 = !DISubprogram(name: "mbtowc", scope: !348, file: !348, line: 922, type: !497, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!497 = !DISubroutineType(types: !498)
!498 = !{!7, !499, !383, !29}
!499 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !503, file: !345, line: 150)
!503 = !DISubprogram(name: "wctomb", scope: !348, file: !348, line: 926, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(types: !505)
!505 = !{!7, !9, !501}
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !507, file: !345, line: 151)
!507 = !DISubprogram(name: "mbstowcs", scope: !348, file: !348, line: 930, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubroutineType(types: !509)
!509 = !{!29, !499, !383, !29}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !511, file: !345, line: 152)
!511 = !DISubprogram(name: "wcstombs", scope: !348, file: !348, line: 933, type: !512, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!512 = !DISubroutineType(types: !513)
!513 = !{!29, !514, !515, !29}
!514 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!515 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !516)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !501)
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !519, file: !345, line: 154)
!519 = !DISubprogram(name: "at_quick_exit", scope: !348, file: !348, line: 597, type: !442, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!520 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !521, file: !345, line: 155)
!521 = !DISubprogram(name: "quick_exit", scope: !348, file: !348, line: 620, type: !447, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !29, file: !523, line: 68)
!523 = !DIFile(filename: "build_tool/../usr/include/c++/v1/cstring", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!524 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !525, file: !523, line: 69)
!525 = !DISubprogram(name: "memcpy", scope: !526, file: !526, line: 42, type: !527, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!526 = !DIFile(filename: "/usr/include/string.h", directory: "")
!527 = !DISubroutineType(types: !528)
!528 = !{!423, !529, !530, !29}
!529 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !423)
!530 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !462)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !532, file: !523, line: 70)
!532 = !DISubprogram(name: "memmove", scope: !526, file: !526, line: 46, type: !533, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!533 = !DISubroutineType(types: !534)
!534 = !{!423, !423, !462, !29}
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !536, file: !523, line: 71)
!536 = !DISubprogram(name: "strcpy", scope: !526, file: !526, line: 121, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!537 = !DISubroutineType(types: !538)
!538 = !{!9, !514, !383}
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !540, file: !523, line: 72)
!540 = !DISubprogram(name: "strncpy", scope: !526, file: !526, line: 124, type: !541, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DISubroutineType(types: !542)
!542 = !{!9, !514, !383, !29}
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !544, file: !523, line: 73)
!544 = !DISubprogram(name: "strcat", scope: !526, file: !526, line: 129, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !546, file: !523, line: 74)
!546 = !DISubprogram(name: "strncat", scope: !526, file: !526, line: 132, type: !541, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !548, file: !523, line: 75)
!548 = !DISubprogram(name: "memcmp", scope: !526, file: !526, line: 63, type: !549, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!549 = !DISubroutineType(types: !550)
!550 = !{!7, !462, !462, !29}
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !552, file: !523, line: 76)
!552 = !DISubprogram(name: "strcmp", scope: !526, file: !526, line: 136, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!553 = !DISubroutineType(types: !554)
!554 = !{!7, !176, !176}
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !556, file: !523, line: 77)
!556 = !DISubprogram(name: "strncmp", scope: !526, file: !526, line: 139, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DISubroutineType(types: !558)
!558 = !{!7, !176, !176, !29}
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !560, file: !523, line: 78)
!560 = !DISubprogram(name: "strcoll", scope: !526, file: !526, line: 143, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !562, file: !523, line: 79)
!562 = !DISubprogram(name: "strxfrm", scope: !526, file: !526, line: 146, type: !563, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!563 = !DISubroutineType(types: !564)
!564 = !{!29, !514, !383, !29}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !566, file: !523, line: 80)
!566 = !DISubprogram(name: "memchr", linkageName: "_Z6memchrUa9enable_ifIXLb1EEEPvim", scope: !567, file: !567, line: 98, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!567 = !DIFile(filename: "build_tool/../usr/include/c++/v1/string.h", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!568 = !DISubroutineType(types: !569)
!569 = !{!423, !423, !7, !29}
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !571, file: !523, line: 81)
!571 = !DISubprogram(name: "strchr", linkageName: "_Z6strchrUa9enable_ifIXLb1EEEPci", scope: !567, file: !567, line: 77, type: !572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!572 = !DISubroutineType(types: !573)
!573 = !{!9, !9, !7}
!574 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !575, file: !523, line: 82)
!575 = !DISubprogram(name: "strcspn", scope: !526, file: !526, line: 272, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!576 = !DISubroutineType(types: !577)
!577 = !{!29, !176, !176}
!578 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !579, file: !523, line: 83)
!579 = !DISubprogram(name: "strpbrk", linkageName: "_Z7strpbrkUa9enable_ifIXLb1EEEPcPKc", scope: !567, file: !567, line: 84, type: !580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!580 = !DISubroutineType(types: !581)
!581 = !{!9, !9, !176}
!582 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !583, file: !523, line: 84)
!583 = !DISubprogram(name: "strrchr", linkageName: "_Z7strrchrUa9enable_ifIXLb1EEEPci", scope: !567, file: !567, line: 91, type: !572, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !585, file: !523, line: 85)
!585 = !DISubprogram(name: "strspn", scope: !526, file: !526, line: 276, type: !576, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!586 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !587, file: !523, line: 86)
!587 = !DISubprogram(name: "strstr", linkageName: "_Z6strstrUa9enable_ifIXLb1EEEPcPKc", scope: !567, file: !567, line: 105, type: !580, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!588 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !589, file: !523, line: 88)
!589 = !DISubprogram(name: "strtok", scope: !526, file: !526, line: 335, type: !537, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!590 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !591, file: !523, line: 90)
!591 = !DISubprogram(name: "memset", scope: !526, file: !526, line: 60, type: !568, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!592 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !593, file: !523, line: 91)
!593 = !DISubprogram(name: "strerror", scope: !526, file: !526, line: 396, type: !594, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!594 = !DISubroutineType(types: !595)
!595 = !{!9, !7}
!596 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !597, file: !523, line: 92)
!597 = !DISubprogram(name: "strlen", scope: !526, file: !526, line: 384, type: !598, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!598 = !DISubroutineType(types: !599)
!599 = !{!29, !176}
!600 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !12, file: !601, line: 152)
!601 = !DIFile(filename: "build_tool/../usr/include/c++/v1/cstdint", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!602 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !603, file: !601, line: 153)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !13, line: 25, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !15, line: 38, baseType: !605)
!605 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!606 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !607, file: !601, line: 154)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 26, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 40, baseType: !7)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !610, file: !601, line: 155)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !13, line: 27, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !15, line: 43, baseType: !26)
!612 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !613, file: !601, line: 157)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !614, line: 24, baseType: !615)
!614 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 37, baseType: !616)
!616 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !618, file: !601, line: 158)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !614, line: 25, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !15, line: 39, baseType: !620)
!620 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !622, file: !601, line: 159)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !614, line: 26, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !15, line: 41, baseType: !418)
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !625, file: !601, line: 160)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !614, line: 27, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !15, line: 44, baseType: !30)
!627 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !628, file: !601, line: 162)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !629, line: 43, baseType: !16)
!629 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!630 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !631, file: !601, line: 163)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !629, line: 44, baseType: !605)
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !633, file: !601, line: 164)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !629, line: 45, baseType: !7)
!634 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !635, file: !601, line: 165)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !629, line: 47, baseType: !26)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !637, file: !601, line: 167)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !629, line: 54, baseType: !616)
!638 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !639, file: !601, line: 168)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !629, line: 55, baseType: !620)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !641, file: !601, line: 169)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !629, line: 56, baseType: !418)
!642 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !643, file: !601, line: 170)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !629, line: 58, baseType: !30)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !645, file: !601, line: 172)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !629, line: 68, baseType: !16)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !647, file: !601, line: 173)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !629, line: 70, baseType: !26)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !649, file: !601, line: 174)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !629, line: 71, baseType: !26)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !651, file: !601, line: 175)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !629, line: 72, baseType: !26)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !653, file: !601, line: 177)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !629, line: 81, baseType: !616)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !655, file: !601, line: 178)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !629, line: 83, baseType: !30)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !657, file: !601, line: 179)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !629, line: 84, baseType: !30)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !659, file: !601, line: 180)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !629, line: 85, baseType: !30)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !661, file: !601, line: 182)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !629, line: 97, baseType: !26)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !663, file: !601, line: 183)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !629, line: 100, baseType: !30)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !665, file: !601, line: 185)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !629, line: 111, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !15, line: 61, baseType: !26)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !668, file: !601, line: 186)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !629, line: 112, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !15, line: 62, baseType: !30)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !671, file: !718, line: 107)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !672, line: 7, baseType: !673)
!672 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !674, line: 245, size: 1728, flags: DIFlagTypePassByValue, elements: !675, identifier: "_ZTS8_IO_FILE")
!674 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "")
!675 = !{!676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !691, !693, !694, !695, !697, !698, !699, !703, !706, !708, !709, !710, !711, !712, !713, !714}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !673, file: !674, line: 246, baseType: !7, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !673, file: !674, line: 251, baseType: !9, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !673, file: !674, line: 252, baseType: !9, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !673, file: !674, line: 253, baseType: !9, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !673, file: !674, line: 254, baseType: !9, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !673, file: !674, line: 255, baseType: !9, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !673, file: !674, line: 256, baseType: !9, size: 64, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !673, file: !674, line: 257, baseType: !9, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !673, file: !674, line: 258, baseType: !9, size: 64, offset: 512)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !673, file: !674, line: 260, baseType: !9, size: 64, offset: 576)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !673, file: !674, line: 261, baseType: !9, size: 64, offset: 640)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !673, file: !674, line: 262, baseType: !9, size: 64, offset: 704)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !673, file: !674, line: 264, baseType: !689, size: 64, offset: 768)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !674, line: 160, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !673, file: !674, line: 266, baseType: !692, size: 64, offset: 832)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !673, file: !674, line: 268, baseType: !7, size: 32, offset: 896)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !673, file: !674, line: 272, baseType: !7, size: 32, offset: 928)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !673, file: !674, line: 274, baseType: !696, size: 64, offset: 960)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !15, line: 140, baseType: !26)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !673, file: !674, line: 278, baseType: !620, size: 16, offset: 1024)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !673, file: !674, line: 279, baseType: !16, size: 8, offset: 1040)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !673, file: !674, line: 280, baseType: !700, size: 8, offset: 1048)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 1)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !673, file: !674, line: 284, baseType: !704, size: 64, offset: 1088)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !674, line: 154, baseType: null)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !673, file: !674, line: 293, baseType: !707, size: 64, offset: 1152)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !15, line: 141, baseType: !26)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !673, file: !674, line: 301, baseType: !423, size: 64, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !673, file: !674, line: 302, baseType: !423, size: 64, offset: 1280)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !673, file: !674, line: 303, baseType: !423, size: 64, offset: 1344)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !673, file: !674, line: 304, baseType: !423, size: 64, offset: 1408)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !673, file: !674, line: 306, baseType: !29, size: 64, offset: 1472)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !673, file: !674, line: 307, baseType: !7, size: 32, offset: 1536)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !673, file: !674, line: 309, baseType: !715, size: 160, offset: 1568)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 20)
!718 = !DIFile(filename: "build_tool/../usr/include/c++/v1/cstdio", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !720, file: !718, line: 108)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !721, line: 78, baseType: !722)
!721 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "_G_fpos_t", file: !723, line: 30, baseType: !724)
!723 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/_G_config.h", directory: "")
!724 = !DICompositeType(tag: DW_TAG_structure_type, file: !723, line: 26, flags: DIFlagFwdDecl, identifier: "_ZTS9_G_fpos_t")
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !29, file: !718, line: 109)
!726 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !727, file: !718, line: 111)
!727 = !DISubprogram(name: "fclose", scope: !721, file: !721, line: 199, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!728 = !DISubroutineType(types: !729)
!729 = !{!7, !730}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !732, file: !718, line: 112)
!732 = !DISubprogram(name: "fflush", scope: !721, file: !721, line: 204, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !734, file: !718, line: 113)
!734 = !DISubprogram(name: "setbuf", scope: !721, file: !721, line: 290, type: !735, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!735 = !DISubroutineType(types: !736)
!736 = !{null, !737, !514}
!737 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !730)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !739, file: !718, line: 114)
!739 = !DISubprogram(name: "setvbuf", scope: !721, file: !721, line: 294, type: !740, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!740 = !DISubroutineType(types: !741)
!741 = !{!7, !737, !514, !7, !29}
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !743, file: !718, line: 115)
!743 = !DISubprogram(name: "fprintf", scope: !721, file: !721, line: 312, type: !744, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!744 = !DISubroutineType(types: !745)
!745 = !{!7, !737, !383, null}
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !747, file: !718, line: 116)
!747 = !DISubprogram(name: "fscanf", scope: !721, file: !721, line: 377, type: !744, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !749, file: !718, line: 117)
!749 = !DISubprogram(name: "snprintf", scope: !721, file: !721, line: 340, type: !750, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!750 = !DISubroutineType(types: !751)
!751 = !{!7, !514, !29, !383, null}
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !753, file: !718, line: 118)
!753 = !DISubprogram(name: "sprintf", scope: !721, file: !721, line: 320, type: !754, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DISubroutineType(types: !755)
!755 = !{!7, !514, !383, null}
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !757, file: !718, line: 119)
!757 = !DISubprogram(name: "sscanf", scope: !721, file: !721, line: 385, type: !758, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!758 = !DISubroutineType(types: !759)
!759 = !{!7, !383, !383, null}
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !761, file: !718, line: 120)
!761 = !DISubprogram(name: "vfprintf", scope: !721, file: !721, line: 327, type: !762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!762 = !DISubroutineType(types: !763)
!763 = !{!7, !737, !383, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, flags: DIFlagTypePassByValue, elements: !766, identifier: "_ZTS13__va_list_tag")
!766 = !{!767, !768, !769, !770}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !765, file: !3, baseType: !418, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !765, file: !3, baseType: !418, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !765, file: !3, baseType: !423, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !765, file: !3, baseType: !423, size: 64, offset: 128)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !772, file: !718, line: 121)
!772 = !DISubprogram(name: "vfscanf", scope: !721, file: !721, line: 420, type: !762, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!773 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !774, file: !718, line: 122)
!774 = !DISubprogram(name: "vsscanf", scope: !721, file: !721, line: 432, type: !775, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!775 = !DISubroutineType(types: !776)
!776 = !{!7, !383, !383, !764}
!777 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !778, file: !718, line: 123)
!778 = !DISubprogram(name: "vsnprintf", scope: !721, file: !721, line: 344, type: !779, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!779 = !DISubroutineType(types: !780)
!780 = !{!7, !514, !29, !383, !764}
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !782, file: !718, line: 124)
!782 = !DISubprogram(name: "vsprintf", scope: !721, file: !721, line: 335, type: !783, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!783 = !DISubroutineType(types: !784)
!784 = !{!7, !514, !383, !764}
!785 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !786, file: !718, line: 125)
!786 = !DISubprogram(name: "fgetc", scope: !721, file: !721, line: 477, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !788, file: !718, line: 126)
!788 = !DISubprogram(name: "fgets", scope: !721, file: !721, line: 564, type: !789, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!9, !514, !7, !737}
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !792, file: !718, line: 127)
!792 = !DISubprogram(name: "fputc", scope: !721, file: !721, line: 517, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!793 = !DISubroutineType(types: !794)
!794 = !{!7, !7, !730}
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !796, file: !718, line: 128)
!796 = !DISubprogram(name: "fputs", scope: !721, file: !721, line: 626, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DISubroutineType(types: !798)
!798 = !{!7, !383, !737}
!799 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !800, file: !718, line: 129)
!800 = !DISubprogram(name: "getc", scope: !721, file: !721, line: 478, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!801 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !802, file: !718, line: 130)
!802 = !DISubprogram(name: "putc", scope: !721, file: !721, line: 518, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !804, file: !718, line: 131)
!804 = !DISubprogram(name: "ungetc", scope: !721, file: !721, line: 639, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !806, file: !718, line: 132)
!806 = !DISubprogram(name: "fread", scope: !721, file: !721, line: 646, type: !807, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!807 = !DISubroutineType(types: !808)
!808 = !{!29, !529, !29, !29, !737}
!809 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !810, file: !718, line: 133)
!810 = !DISubprogram(name: "fwrite", scope: !721, file: !721, line: 652, type: !811, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!811 = !DISubroutineType(types: !812)
!812 = !{!29, !530, !29, !29, !737}
!813 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !814, file: !718, line: 134)
!814 = !DISubprogram(name: "fgetpos", scope: !721, file: !721, line: 731, type: !815, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!815 = !DISubroutineType(types: !816)
!816 = !{!7, !737, !817}
!817 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!819 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !820, file: !718, line: 135)
!820 = !DISubprogram(name: "fseek", scope: !721, file: !721, line: 684, type: !821, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!821 = !DISubroutineType(types: !822)
!822 = !{!7, !730, !26, !7}
!823 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !824, file: !718, line: 136)
!824 = !DISubprogram(name: "fsetpos", scope: !721, file: !721, line: 736, type: !825, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!825 = !DISubroutineType(types: !826)
!826 = !{!7, !730, !827}
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !830, file: !718, line: 137)
!830 = !DISubprogram(name: "ftell", scope: !721, file: !721, line: 689, type: !831, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!831 = !DISubroutineType(types: !832)
!832 = !{!26, !730}
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !834, file: !718, line: 138)
!834 = !DISubprogram(name: "rewind", scope: !721, file: !721, line: 694, type: !835, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !730}
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !838, file: !718, line: 139)
!838 = !DISubprogram(name: "clearerr", scope: !721, file: !721, line: 757, type: !835, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !840, file: !718, line: 140)
!840 = !DISubprogram(name: "feof", scope: !721, file: !721, line: 759, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !842, file: !718, line: 141)
!842 = !DISubprogram(name: "ferror", scope: !721, file: !721, line: 761, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!843 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !844, file: !718, line: 142)
!844 = !DISubprogram(name: "perror", scope: !721, file: !721, line: 775, type: !845, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !176}
!847 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !848, file: !718, line: 145)
!848 = !DISubprogram(name: "fopen", scope: !721, file: !721, line: 232, type: !849, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!849 = !DISubroutineType(types: !850)
!850 = !{!730, !383, !383}
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !852, file: !718, line: 146)
!852 = !DISubprogram(name: "freopen", scope: !721, file: !721, line: 238, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!853 = !DISubroutineType(types: !854)
!854 = !{!730, !383, !383, !737}
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !856, file: !718, line: 147)
!856 = !DISubprogram(name: "remove", scope: !721, file: !721, line: 144, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!857 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !858, file: !718, line: 148)
!858 = !DISubprogram(name: "rename", scope: !721, file: !721, line: 146, type: !553, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !860, file: !718, line: 149)
!860 = !DISubprogram(name: "tmpfile", scope: !721, file: !721, line: 159, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DISubroutineType(types: !862)
!862 = !{!730}
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !864, file: !718, line: 150)
!864 = !DISubprogram(name: "tmpnam", scope: !721, file: !721, line: 173, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!865 = !DISubroutineType(types: !866)
!866 = !{!9, !9}
!867 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !868, file: !718, line: 154)
!868 = !DISubprogram(name: "getchar", scope: !869, file: !869, line: 44, type: !412, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!869 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !871, file: !718, line: 158)
!871 = !DISubprogram(name: "scanf", scope: !721, file: !721, line: 383, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!872 = !DISubroutineType(types: !873)
!873 = !{!7, !383, null}
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !875, file: !718, line: 159)
!875 = !DISubprogram(name: "vscanf", scope: !721, file: !721, line: 428, type: !876, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!876 = !DISubroutineType(types: !877)
!877 = !{!7, !383, !764}
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !879, file: !718, line: 163)
!879 = !DISubprogram(name: "printf", scope: !721, file: !721, line: 318, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !881, file: !718, line: 164)
!881 = !DISubprogram(name: "putchar", scope: !869, file: !869, line: 79, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!882 = !DISubroutineType(types: !883)
!883 = !{!7, !7}
!884 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !885, file: !718, line: 165)
!885 = !DISubprogram(name: "puts", scope: !721, file: !721, line: 632, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!886 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !887, file: !718, line: 166)
!887 = !DISubprogram(name: "vprintf", scope: !869, file: !869, line: 36, type: !876, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !889, file: !891, line: 103)
!889 = !DISubprogram(name: "isalnum", scope: !890, file: !890, line: 174, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!890 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!891 = !DIFile(filename: "build_tool/../usr/include/c++/v1/cctype", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!892 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !893, file: !891, line: 104)
!893 = !DISubprogram(name: "isalpha", scope: !890, file: !890, line: 175, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !895, file: !891, line: 105)
!895 = !DISubprogram(name: "isblank", scope: !890, file: !890, line: 186, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !897, file: !891, line: 106)
!897 = !DISubprogram(name: "iscntrl", scope: !890, file: !890, line: 176, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!898 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !899, file: !891, line: 107)
!899 = !DISubprogram(name: "isdigit", scope: !890, file: !890, line: 177, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !901, file: !891, line: 108)
!901 = !DISubprogram(name: "isgraph", scope: !890, file: !890, line: 179, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!902 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !903, file: !891, line: 109)
!903 = !DISubprogram(name: "islower", scope: !890, file: !890, line: 178, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !905, file: !891, line: 110)
!905 = !DISubprogram(name: "isprint", scope: !890, file: !890, line: 180, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!906 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !907, file: !891, line: 111)
!907 = !DISubprogram(name: "ispunct", scope: !890, file: !890, line: 181, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !909, file: !891, line: 112)
!909 = !DISubprogram(name: "isspace", scope: !890, file: !890, line: 182, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!910 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !911, file: !891, line: 113)
!911 = !DISubprogram(name: "isupper", scope: !890, file: !890, line: 183, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !913, file: !891, line: 114)
!913 = !DISubprogram(name: "isxdigit", scope: !890, file: !890, line: 184, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!914 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !915, file: !891, line: 115)
!915 = !DISubprogram(name: "tolower", scope: !890, file: !890, line: 207, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !917, file: !891, line: 116)
!917 = !DISubprogram(name: "toupper", scope: !890, file: !890, line: 213, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!918 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !919, file: !921, line: 62)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !920, line: 20, baseType: !418)
!920 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "")
!921 = !DIFile(filename: "build_tool/../usr/include/c++/v1/cwctype", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!922 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !923, file: !921, line: 63)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !924, line: 48, baseType: !925)
!924 = !DIFile(filename: "/usr/include/wctype.h", directory: "")
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !928, file: !921, line: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !929, line: 38, baseType: !30)
!929 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/wctype-wchar.h", directory: "")
!930 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !931, file: !921, line: 65)
!931 = !DISubprogram(name: "iswalnum", scope: !929, file: !929, line: 95, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!932 = !DISubroutineType(types: !933)
!933 = !{!7, !919}
!934 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !935, file: !921, line: 66)
!935 = !DISubprogram(name: "iswalpha", scope: !929, file: !929, line: 101, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!936 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !937, file: !921, line: 67)
!937 = !DISubprogram(name: "iswblank", scope: !929, file: !929, line: 146, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!938 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !939, file: !921, line: 68)
!939 = !DISubprogram(name: "iswcntrl", scope: !929, file: !929, line: 104, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!940 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !941, file: !921, line: 69)
!941 = !DISubprogram(name: "iswdigit", scope: !929, file: !929, line: 108, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!942 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !943, file: !921, line: 70)
!943 = !DISubprogram(name: "iswgraph", scope: !929, file: !929, line: 112, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!944 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !945, file: !921, line: 71)
!945 = !DISubprogram(name: "iswlower", scope: !929, file: !929, line: 117, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!946 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !947, file: !921, line: 72)
!947 = !DISubprogram(name: "iswprint", scope: !929, file: !929, line: 120, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!948 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !949, file: !921, line: 73)
!949 = !DISubprogram(name: "iswpunct", scope: !929, file: !929, line: 125, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!950 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !951, file: !921, line: 74)
!951 = !DISubprogram(name: "iswspace", scope: !929, file: !929, line: 130, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!952 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !953, file: !921, line: 75)
!953 = !DISubprogram(name: "iswupper", scope: !929, file: !929, line: 135, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!954 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !955, file: !921, line: 76)
!955 = !DISubprogram(name: "iswxdigit", scope: !929, file: !929, line: 140, type: !932, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!956 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !957, file: !921, line: 77)
!957 = !DISubprogram(name: "iswctype", scope: !929, file: !929, line: 159, type: !958, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!958 = !DISubroutineType(types: !959)
!959 = !{!7, !919, !928}
!960 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !961, file: !921, line: 78)
!961 = !DISubprogram(name: "wctype", scope: !929, file: !929, line: 155, type: !962, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!962 = !DISubroutineType(types: !963)
!963 = !{!928, !176}
!964 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !965, file: !921, line: 79)
!965 = !DISubprogram(name: "towlower", scope: !929, file: !929, line: 166, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!966 = !DISubroutineType(types: !967)
!967 = !{!919, !919}
!968 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !969, file: !921, line: 80)
!969 = !DISubprogram(name: "towupper", scope: !929, file: !929, line: 169, type: !966, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!970 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !971, file: !921, line: 81)
!971 = !DISubprogram(name: "towctrans", scope: !924, file: !924, line: 55, type: !972, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!972 = !DISubroutineType(types: !973)
!973 = !{!919, !919, !923}
!974 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !975, file: !921, line: 82)
!975 = !DISubprogram(name: "wctrans", scope: !924, file: !924, line: 52, type: !976, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!976 = !DISubroutineType(types: !977)
!977 = !{!923, !176}
!978 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !979, file: !994, line: 115)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !980, line: 6, baseType: !981)
!980 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "")
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !982, line: 21, baseType: !983)
!982 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "")
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !982, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !984, identifier: "_ZTS11__mbstate_t")
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !983, file: !982, line: 15, baseType: !7, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !983, file: !982, line: 20, baseType: !987, size: 32, offset: 32)
!987 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !982, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !988, identifier: "_ZTSN11__mbstate_tUt_E")
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !987, file: !982, line: 18, baseType: !418, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !987, file: !982, line: 19, baseType: !991, size: 32)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 4)
!994 = !DIFile(filename: "build_tool/../usr/include/c++/v1/cwchar", directory: "/home/mcopik/projects/ETH/extrap/rebuild")
!995 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !29, file: !994, line: 116)
!996 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !997, file: !994, line: 117)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !998, line: 7, size: 448, flags: DIFlagTypePassByValue, elements: !999, identifier: "_ZTS2tm")
!998 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !997, file: !998, line: 9, baseType: !7, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !997, file: !998, line: 10, baseType: !7, size: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !997, file: !998, line: 11, baseType: !7, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !997, file: !998, line: 12, baseType: !7, size: 32, offset: 96)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !997, file: !998, line: 13, baseType: !7, size: 32, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !997, file: !998, line: 14, baseType: !7, size: 32, offset: 160)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !997, file: !998, line: 15, baseType: !7, size: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !997, file: !998, line: 16, baseType: !7, size: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !997, file: !998, line: 17, baseType: !7, size: 32, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !997, file: !998, line: 20, baseType: !26, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !997, file: !998, line: 21, baseType: !176, size: 64, offset: 384)
!1011 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !919, file: !994, line: 118)
!1012 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !671, file: !994, line: 119)
!1013 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1014, file: !994, line: 120)
!1014 = !DISubprogram(name: "fwprintf", scope: !1015, file: !1015, line: 580, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1015 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!7, !1018, !515, null}
!1018 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !1021, line: 5, baseType: !673)
!1021 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "")
!1022 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1023, file: !994, line: 121)
!1023 = !DISubprogram(name: "fwscanf", scope: !1015, file: !1015, line: 621, type: !1016, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1024 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1025, file: !994, line: 122)
!1025 = !DISubprogram(name: "swprintf", scope: !1015, file: !1015, line: 590, type: !1026, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!7, !499, !29, !515, null}
!1028 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1029, file: !994, line: 123)
!1029 = !DISubprogram(name: "vfwprintf", scope: !1015, file: !1015, line: 598, type: !1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!7, !1018, !515, !764}
!1032 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1033, file: !994, line: 124)
!1033 = !DISubprogram(name: "vswprintf", scope: !1015, file: !1015, line: 611, type: !1034, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!7, !499, !29, !515, !764}
!1036 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1037, file: !994, line: 125)
!1037 = !DISubprogram(name: "swscanf", scope: !1015, file: !1015, line: 631, type: !1038, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!7, !515, !515, null}
!1040 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1041, file: !994, line: 126)
!1041 = !DISubprogram(name: "vfwscanf", scope: !1015, file: !1015, line: 673, type: !1030, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1042 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1043, file: !994, line: 127)
!1043 = !DISubprogram(name: "vswscanf", scope: !1015, file: !1015, line: 685, type: !1044, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!7, !515, !515, !764}
!1046 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1047, file: !994, line: 128)
!1047 = !DISubprogram(name: "fgetwc", scope: !1015, file: !1015, line: 727, type: !1048, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!919, !1019}
!1050 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1051, file: !994, line: 129)
!1051 = !DISubprogram(name: "fgetws", scope: !1015, file: !1015, line: 756, type: !1052, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!500, !499, !7, !1018}
!1054 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !22, entity: !1055, file: !994, line: 130)
