; RUN: opt %loadpass  -o /dev/null < %s 2> /dev/null | diff -w %s.json -
; ModuleID = 'bt.c'
source_filename = "bt.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }

@.str = private unnamed_addr constant [7 x i8] c"extrap\00", section "llvm.metadata"
@.str.1 = private unnamed_addr constant [5 x i8] c"bt.c\00", section "llvm.metadata"
@.str.2 = private unnamed_addr constant [76 x i8] c"\0A\0A NAS Parallel Benchmarks 3.0 structured OpenMP C version - BT Benchmark\0A\0A\00", align 1
@.str.3 = private unnamed_addr constant [13 x i8] c"inputbt.data\00", align 1
@.str.4 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.5 = private unnamed_addr constant [38 x i8] c" Reading from input file inputbt.data\00", align 1
@.str.6 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.7 = private unnamed_addr constant [4 x i8] c"%lg\00", align 1
@dt = internal global double 0.000000e+00, align 8, !dbg !0
@.str.8 = private unnamed_addr constant [7 x i8] c"%d%d%d\00", align 1
@grid_points = internal global [3 x i32] zeroinitializer, align 4, !dbg !9

!231 = distinct !DIGlobalVariable(name: "dtty2", scope: !2, file: !11, line: 46, type: !7, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "dttz1", scope: !2, file: !11, line: 46, type: !7, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "dttz2", scope: !2, file: !11, line: 46, type: !7, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "c2dttx1", scope: !2, file: !11, line: 47, type: !7, isLocal: true, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "c2dtty1", scope: !2, file: !11, line: 47, type: !7, isLocal: true, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "c2dttz1", scope: !2, file: !11, line: 47, type: !7, isLocal: true, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "dtdssp", scope: !2, file: !11, line: 45, type: !7, isLocal: true, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "comz1", scope: !2, file: !11, line: 47, type: !7, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "comz4", scope: !2, file: !11, line: 47, type: !7, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "comz5", scope: !2, file: !11, line: 47, type: !7, isLocal: true, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "comz6", scope: !2, file: !11, line: 47, type: !7, isLocal: true, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "c3c4tx3", scope: !2, file: !11, line: 48, type: !7, isLocal: true, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "c3c4ty3", scope: !2, file: !11, line: 48, type: !7, isLocal: true, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "c3c4tz3", scope: !2, file: !11, line: 48, type: !7, isLocal: true, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "c2iv", scope: !2, file: !11, line: 48, type: !7, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "con16", scope: !2, file: !11, line: 48, type: !7, isLocal: true, isDefinition: true)
!262 = !{i32 2, !"Dwarf Version", i32 4}
!263 = !{i32 2, !"Debug Info Version", i32 3}
!264 = !{i32 1, !"wchar_size", i32 4}
!265 = !{!"clang version 8.0.0 (git@github.com:llvm-mirror/clang.git e3e8f2a67bc17cb4f751b22e53e16d7c39b371d0) (git@github.com:llvm-mirror/LLVM.git 48e9774b6791c48760d18775039eefa6d824522d)"}
!266 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 74, type: !267, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !272)
!267 = !DISubroutineType(types: !268)
!268 = !{!13, !13, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !285, !286}
!273 = !DILocalVariable(name: "argc", arg: 1, scope: !266, file: !3, line: 74, type: !13)
!274 = !DILocalVariable(name: "argv", arg: 2, scope: !266, file: !3, line: 74, type: !269)
!275 = !DILocalVariable(name: "niter", scope: !266, file: !3, line: 76, type: !13)
!276 = !DILocalVariable(name: "step", scope: !266, file: !3, line: 76, type: !13)
!277 = !DILocalVariable(name: "n3", scope: !266, file: !3, line: 76, type: !13)
!278 = !DILocalVariable(name: "nthreads", scope: !266, file: !3, line: 77, type: !13)
!279 = !DILocalVariable(name: "navg", scope: !266, file: !3, line: 78, type: !7)
!280 = !DILocalVariable(name: "mflops", scope: !266, file: !3, line: 78, type: !7)
!281 = !DILocalVariable(name: "tmax", scope: !266, file: !3, line: 80, type: !7)
!282 = !DILocalVariable(name: "verified", scope: !266, file: !3, line: 81, type: !283)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "boolean", file: !284, line: 12, baseType: !13)
!284 = !DIFile(filename: "../common/npb-C.h", directory: "/home/mcopik/projects/bitcodes/NPB3.0-omp-C_source/BT")
!285 = !DILocalVariable(name: "class", scope: !266, file: !3, line: 82, type: !271)
!286 = !DILocalVariable(name: "fp", scope: !266, file: !3, line: 83, type: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !289, line: 7, baseType: !290)
!289 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "/home/mcopik/projects/bitcodes/NPB3.0-omp-C_source/BT")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !291, line: 245, size: 1728, elements: !292)
!291 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/home/mcopik/projects/bitcodes/NPB3.0-omp-C_source/BT")
!292 = !{!293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !313, !314, !315, !316, !320, !322, !324, !328, !331, !333, !334, !335, !336, !337, !341, !342}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !290, file: !291, line: 246, baseType: !13, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !290, file: !291, line: 251, baseType: !270, size: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !290, file: !291, line: 252, baseType: !270, size: 64, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !290, file: !291, line: 253, baseType: !270, size: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !290, file: !291, line: 254, baseType: !270, size: 64, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !290, file: !291, line: 255, baseType: !270, size: 64, offset: 320)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !290, file: !291, line: 256, baseType: !270, size: 64, offset: 384)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !290, file: !291, line: 257, baseType: !270, size: 64, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !290, file: !291, line: 258, baseType: !270, size: 64, offset: 512)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !290, file: !291, line: 260, baseType: !270, size: 64, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !290, file: !291, line: 261, baseType: !270, size: 64, offset: 640)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !290, file: !291, line: 262, baseType: !270, size: 64, offset: 704)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !290, file: !291, line: 264, baseType: !306, size: 64, offset: 768)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !291, line: 160, size: 192, elements: !308)
!308 = !{!309, !310, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !307, file: !291, line: 161, baseType: !306, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !307, file: !291, line: 162, baseType: !311, size: 64, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !307, file: !291, line: 166, baseType: !13, size: 32, offset: 128)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !290, file: !291, line: 266, baseType: !311, size: 64, offset: 832)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !290, file: !291, line: 268, baseType: !13, size: 32, offset: 896)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !290, file: !291, line: 272, baseType: !13, size: 32, offset: 928)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !290, file: !291, line: 274, baseType: !317, size: 64, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !318, line: 140, baseType: !319)
!318 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/mcopik/projects/bitcodes/NPB3.0-omp-C_source/BT")
!319 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !290, file: !291, line: 278, baseType: !321, size: 16, offset: 1024)
!321 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !290, file: !291, line: 279, baseType: !323, size: 8, offset: 1040)
!323 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !290, file: !291, line: 280, baseType: !325, size: 8, offset: 1048)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 8, elements: !326)
!326 = !{!327}
!327 = !DISubrange(count: 1)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !290, file: !291, line: 284, baseType: !329, size: 64, offset: 1088)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !291, line: 154, baseType: null)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !290, file: !291, line: 293, baseType: !332, size: 64, offset: 1152)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !318, line: 141, baseType: !319)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !290, file: !291, line: 301, baseType: !6, size: 64, offset: 1216)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !290, file: !291, line: 302, baseType: !6, size: 64, offset: 1280)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !290, file: !291, line: 303, baseType: !6, size: 64, offset: 1344)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !290, file: !291, line: 304, baseType: !6, size: 64, offset: 1408)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !290, file: !291, line: 306, baseType: !338, size: 64, offset: 1472)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !339, line: 62, baseType: !340)
!339 = !DIFile(filename: "/home/mcopik/projects/clang_llvm/build_release/lib/clang/8.0.0/include/stddef.h", directory: "/home/mcopik/projects/bitcodes/NPB3.0-omp-C_source/BT")
!340 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !290, file: !291, line: 307, baseType: !13, size: 32, offset: 1536)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !290, file: !291, line: 309, baseType: !343, size: 160, offset: 1568)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 160, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 20)
!346 = !{!347, !347, i64 0}
!347 = !{!"int", !348, i64 0}
!348 = !{!"omnipotent char", !349, i64 0}
!349 = !{!"Simple C/C++ TBAA"}
!350 = !DILocation(line: 74, column: 14, scope: !266)
!351 = !{!352, !352, i64 0}
!352 = !{!"any pointer", !348, i64 0}
!353 = !DILocation(line: 74, column: 27, scope: !266)
!354 = !DILocation(line: 76, column: 3, scope: !266)
!355 = !DILocation(line: 76, column: 7, scope: !266)
!356 = !DILocation(line: 76, column: 21, scope: !266)
!357 = !DILocation(line: 76, column: 27, scope: !266)
!358 = !DILocation(line: 77, column: 3, scope: !266)
!359 = !DILocation(line: 77, column: 7, scope: !266)
!360 = !DILocation(line: 78, column: 3, scope: !266)
!361 = !DILocation(line: 78, column: 10, scope: !266)
!362 = !DILocation(line: 78, column: 16, scope: !266)
!363 = !DILocation(line: 80, column: 3, scope: !266)
!364 = !DILocation(line: 80, column: 10, scope: !266)
!365 = !DILocation(line: 81, column: 3, scope: !266)
!366 = !DILocation(line: 81, column: 11, scope: !266)
!367 = !DILocation(line: 82, column: 3, scope: !266)
!368 = !DILocation(line: 82, column: 8, scope: !266)
!369 = !DILocation(line: 83, column: 3, scope: !266)
!370 = !DILocation(line: 83, column: 9, scope: !266)
!371 = !DILocation(line: 90, column: 3, scope: !266)
!372 = !DILocation(line: 93, column: 8, scope: !266)
!373 = !DILocation(line: 93, column: 6, scope: !266)
!374 = !DILocation(line: 94, column: 7, scope: !375)
!375 = distinct !DILexicalBlock(scope: !266, file: !3, line: 94, column: 7)
!376 = !DILocation(line: 94, column: 10, scope: !375)
!377 = !DILocation(line: 94, column: 7, scope: !266)
!378 = !DILocation(line: 95, column: 5, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !3, line: 94, column: 19)
!380 = !DILocation(line: 96, column: 12, scope: !379)
!381 = !DILocation(line: 96, column: 5, scope: !379)
!382 = !DILocation(line: 97, column: 5, scope: !379)
!383 = !DILocation(line: 97, column: 18, scope: !379)
!384 = !DILocation(line: 97, column: 12, scope: !379)
!385 = !DILocation(line: 97, column: 22, scope: !379)
!386 = distinct !{!386, !382, !387}
!387 = !DILocation(line: 97, column: 30, scope: !379)
!388 = !DILocation(line: 98, column: 12, scope: !379)
!389 = !DILocation(line: 98, column: 5, scope: !379)
!390 = !DILocation(line: 99, column: 5, scope: !379)
!391 = !DILocation(line: 99, column: 18, scope: !379)
!392 = !DILocation(line: 99, column: 12, scope: !379)
!393 = !DILocation(line: 99, column: 22, scope: !379)
!394 = distinct !{!394, !390, !395}
!395 = !DILocation(line: 99, column: 30, scope: !379)
!396 = !DILocation(line: 100, column: 12, scope: !379)
!397 = !DILocation(line: 100, column: 5, scope: !379)
!398 = !DILocation(line: 102, column: 12, scope: !379)
!399 = !DILocation(line: 102, column: 5, scope: !379)
!400 = !DILocation(line: 103, column: 3, scope: !379)
!401 = !DILocation(line: 104, column: 5, scope: !402)
!402 = distinct !DILexicalBlock(scope: !375, file: !3, line: 103, column: 10)
!403 = !DILocation(line: 106, column: 11, scope: !402)
!404 = !DILocation(line: 107, column: 11, scope: !402)
!405 = !{!406, !406, i64 0}
!406 = !{!"double", !348, i64 0}
!407 = !DILocation(line: 108, column: 20, scope: !402)
!408 = !DILocation(line: 109, column: 20, scope: !402)
!409 = !DILocation(line: 110, column: 20, scope: !402)
!410 = !DILocation(line: 114, column: 3, scope: !266)
!411 = !DILocation(line: 114, column: 19, scope: !266)
!412 = !DILocation(line: 114, column: 35, scope: !266)
!413 = !DILocation(line: 113, column: 3, scope: !266)
!414 = !DILocation(line: 115, column: 45, scope: !266)
!415 = !DILocation(line: 115, column: 52, scope: !266)
!416 = !DILocation(line: 115, column: 3, scope: !266)
!417 = !DILocation(line: 117, column: 7, scope: !418)
