; RUN: opt %loadpass  -o /dev/null < %s 2> /dev/null | diff -w %s.json -
; ModuleID = 'tests/extrap/prune.cpp'
source_filename = "tests/extrap/prune.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::basic_ifstream" = type { %"class.std::basic_istream.base", %"class.std::basic_filebuf", %"class.std::basic_ios" }
%"class.std::basic_istream.base" = type { i32 (...)**, i64 }
%"class.std::basic_filebuf" = type { %"class.std::basic_streambuf", %union.pthread_mutex_t, %"class.std::__basic_file", i32, %struct.__mbstate_t, %struct.__mbstate_t, %struct.__mbstate_t, i8*, i64, i8, i8, i8, i8, i8*, i8*, i8, %"class.std::codecvt"*, i8*, i64, i8*, i8* }
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%"class.std::__basic_file" = type <{ %struct._IO_FILE*, i8, [7 x i8] }>

!318 = !DISubprogram(name: "rint", scope: !29, file: !29, line: 256, type: !30, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !320, file: !32, line: 1203)
!320 = !DISubprogram(name: "rintf", scope: !29, file: !29, line: 256, type: !95, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !322, file: !32, line: 1204)
!322 = !DISubprogram(name: "rintl", scope: !29, file: !29, line: 256, type: !99, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !324, file: !32, line: 1206)
!324 = !DISubprogram(name: "round", scope: !29, file: !29, line: 298, type: !30, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !326, file: !32, line: 1207)
!326 = !DISubprogram(name: "roundf", scope: !29, file: !29, line: 298, type: !95, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!327 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !328, file: !32, line: 1208)
!328 = !DISubprogram(name: "roundl", scope: !29, file: !29, line: 298, type: !99, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !330, file: !32, line: 1210)
!330 = !DISubprogram(name: "scalbln", scope: !29, file: !29, line: 290, type: !331, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!331 = !DISubroutineType(types: !332)
!332 = !{!6, !6, !16}
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !334, file: !32, line: 1211)
!334 = !DISubprogram(name: "scalblnf", scope: !29, file: !29, line: 290, type: !335, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!335 = !DISubroutineType(types: !336)
!336 = !{!90, !90, !16}
!337 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !338, file: !32, line: 1212)
!338 = !DISubprogram(name: "scalblnl", scope: !29, file: !29, line: 290, type: !339, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!339 = !DISubroutineType(types: !340)
!340 = !{!101, !101, !16}
!341 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !342, file: !32, line: 1214)
!342 = !DISubprogram(name: "scalbn", scope: !29, file: !29, line: 276, type: !62, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !344, file: !32, line: 1215)
!344 = !DISubprogram(name: "scalbnf", scope: !29, file: !29, line: 276, type: !345, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!345 = !DISubroutineType(types: !346)
!346 = !{!90, !90, !7}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !348, file: !32, line: 1216)
!348 = !DISubprogram(name: "scalbnl", scope: !29, file: !29, line: 276, type: !349, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!349 = !DISubroutineType(types: !350)
!350 = !{!101, !101, !7}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !352, file: !32, line: 1218)
!352 = !DISubprogram(name: "tgamma", scope: !29, file: !29, line: 235, type: !30, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !354, file: !32, line: 1219)
!354 = !DISubprogram(name: "tgammaf", scope: !29, file: !29, line: 235, type: !95, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !356, file: !32, line: 1220)
!356 = !DISubprogram(name: "tgammal", scope: !29, file: !29, line: 235, type: !99, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!357 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !358, file: !32, line: 1222)
!358 = !DISubprogram(name: "trunc", scope: !29, file: !29, line: 302, type: !30, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !360, file: !32, line: 1223)
!360 = !DISubprogram(name: "truncf", scope: !29, file: !29, line: 302, type: !95, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!361 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !362, file: !32, line: 1224)
!362 = !DISubprogram(name: "truncl", scope: !29, file: !29, line: 302, type: !99, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!363 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !364, file: !366, line: 127)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !23, line: 62, baseType: !365)
!365 = !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!366 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/7.3.0/../../../../include/c++/7.3.0/cstdlib", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!367 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !368, file: !366, line: 128)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !23, line: 70, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 66, size: 128, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !370, identifier: "_ZTS6ldiv_t")
!370 = !{!371, !372}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !369, file: !23, line: 68, baseType: !16, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !369, file: !23, line: 69, baseType: !16, size: 64, offset: 64)
!373 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !374, file: !366, line: 130)
!374 = !DISubprogram(name: "abort", scope: !23, file: !23, line: 588, type: !375, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!375 = !DISubroutineType(types: !376)
!376 = !{null}
!377 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !378, file: !366, line: 134)
!378 = !DISubprogram(name: "atexit", scope: !23, file: !23, line: 592, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!379 = !DISubroutineType(types: !380)
!380 = !{!7, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !383, file: !366, line: 137)
!383 = !DISubprogram(name: "at_quick_exit", scope: !23, file: !23, line: 597, type: !379, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !385, file: !366, line: 140)
!385 = !DISubprogram(name: "atof", scope: !386, file: !386, line: 25, type: !265, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!386 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !388, file: !366, line: 141)
!388 = distinct !DISubprogram(name: "atoi", scope: !23, file: !23, line: 361, type: !389, isLocal: false, isDefinition: true, scopeLine: 362, flags: DIFlagPrototyped, isOptimized: true, unit: !2, retainedNodes: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!7, !267}
!391 = !{!392}
!392 = !DILocalVariable(name: "__nptr", arg: 1, scope: !388, file: !23, line: 361, type: !267)
!393 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !394, file: !366, line: 142)
!394 = !DISubprogram(name: "atol", scope: !23, file: !23, line: 366, type: !395, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!395 = !DISubroutineType(types: !396)
!396 = !{!16, !267}
!397 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !398, file: !366, line: 143)
!398 = !DISubprogram(name: "bsearch", scope: !399, file: !399, line: 20, type: !400, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!399 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !403, !403, !405, !405, !408}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !406, line: 62, baseType: !407)
!406 = !DIFile(filename: "/home/mcopik/projects/clang_llvm/build_release/lib/clang/8.0.0/include/stddef.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!407 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !23, line: 805, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!7, !403, !403}
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !413, file: !366, line: 144)
!413 = !DISubprogram(name: "calloc", scope: !23, file: !23, line: 541, type: !414, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!414 = !DISubroutineType(types: !415)
!415 = !{!402, !405, !405}
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !417, file: !366, line: 145)
!417 = !DISubprogram(name: "div", scope: !23, file: !23, line: 849, type: !418, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!418 = !DISubroutineType(types: !419)
!419 = !{!364, !7, !7}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !421, file: !366, line: 146)
!421 = !DISubprogram(name: "exit", scope: !23, file: !23, line: 614, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !7}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !425, file: !366, line: 147)
!425 = !DISubprogram(name: "free", scope: !23, file: !23, line: 563, type: !426, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !402}
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !429, file: !366, line: 148)
!429 = !DISubprogram(name: "getenv", scope: !23, file: !23, line: 631, type: !430, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!430 = !DISubroutineType(types: !431)
!431 = !{!9, !267}
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !433, file: !366, line: 149)
!433 = !DISubprogram(name: "labs", scope: !23, file: !23, line: 838, type: !434, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!434 = !DISubroutineType(types: !435)
!435 = !{!16, !16}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !437, file: !366, line: 150)
!437 = !DISubprogram(name: "ldiv", scope: !23, file: !23, line: 851, type: !438, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!438 = !DISubroutineType(types: !439)
!439 = !{!368, !16, !16}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !441, file: !366, line: 151)
!441 = !DISubprogram(name: "malloc", scope: !23, file: !23, line: 539, type: !442, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!442 = !DISubroutineType(types: !443)
!443 = !{!402, !405}
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !445, file: !366, line: 153)
!445 = !DISubprogram(name: "mblen", scope: !23, file: !23, line: 919, type: !446, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!446 = !DISubroutineType(types: !447)
!447 = !{!7, !267, !405}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !449, file: !366, line: 154)
!449 = !DISubprogram(name: "mbstowcs", scope: !23, file: !23, line: 930, type: !450, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!450 = !DISubroutineType(types: !451)
!451 = !{!405, !452, !455, !405}
!452 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!455 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !267)
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !457, file: !366, line: 155)
!457 = !DISubprogram(name: "mbtowc", scope: !23, file: !23, line: 922, type: !458, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!458 = !DISubroutineType(types: !459)
!459 = !{!7, !452, !455, !405}
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !461, file: !366, line: 157)
!461 = !DISubprogram(name: "qsort", scope: !23, file: !23, line: 827, type: !462, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !402, !405, !405, !408}
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !465, file: !366, line: 160)
!465 = !DISubprogram(name: "quick_exit", scope: !23, file: !23, line: 620, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!466 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !467, file: !366, line: 163)
!467 = !DISubprogram(name: "rand", scope: !23, file: !23, line: 453, type: !468, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!468 = !DISubroutineType(types: !469)
!469 = !{!7}
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !471, file: !366, line: 164)
!471 = !DISubprogram(name: "realloc", scope: !23, file: !23, line: 549, type: !472, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!472 = !DISubroutineType(types: !473)
!473 = !{!402, !402, !405}
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !475, file: !366, line: 165)
!475 = !DISubprogram(name: "srand", scope: !23, file: !23, line: 455, type: !476, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !478}
!478 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !480, file: !366, line: 166)
!480 = !DISubprogram(name: "strtod", scope: !23, file: !23, line: 117, type: !481, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!481 = !DISubroutineType(types: !482)
!482 = !{!6, !455, !483}
!483 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !8)
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !485, file: !366, line: 167)
!485 = !DISubprogram(name: "strtol", scope: !23, file: !23, line: 176, type: !486, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!486 = !DISubroutineType(types: !487)
!487 = !{!16, !455, !483, !7}
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !489, file: !366, line: 168)
!489 = !DISubprogram(name: "strtoul", scope: !23, file: !23, line: 180, type: !490, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!490 = !DISubroutineType(types: !491)
!491 = !{!407, !455, !483, !7}
!492 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !493, file: !366, line: 169)
!493 = !DISubprogram(name: "system", scope: !23, file: !23, line: 781, type: !389, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !495, file: !366, line: 171)
!495 = !DISubprogram(name: "wcstombs", scope: !23, file: !23, line: 933, type: !496, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!496 = !DISubroutineType(types: !497)
!497 = !{!405, !498, !499, !405}
!498 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!499 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !500)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !503, file: !366, line: 172)
!503 = !DISubprogram(name: "wctomb", scope: !23, file: !23, line: 926, type: !504, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!504 = !DISubroutineType(types: !505)
!505 = !{!7, !9, !454}
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !508, file: !366, line: 200)
!507 = !DINamespace(name: "__gnu_cxx", scope: null)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !23, line: 80, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !23, line: 76, size: 128, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !510, identifier: "_ZTS7lldiv_t")
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !509, file: !23, line: 78, baseType: !212, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !509, file: !23, line: 79, baseType: !212, size: 64, offset: 64)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !514, file: !366, line: 206)
!514 = !DISubprogram(name: "_Exit", scope: !23, file: !23, line: 626, type: !422, isLocal: false, isDefinition: false, flags: DIFlagPrototyped | DIFlagNoReturn, isOptimized: true)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !516, file: !366, line: 210)
!516 = !DISubprogram(name: "llabs", scope: !23, file: !23, line: 841, type: !517, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!517 = !DISubroutineType(types: !518)
!518 = !{!212, !212}
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !520, file: !366, line: 216)
!520 = !DISubprogram(name: "lldiv", scope: !23, file: !23, line: 855, type: !521, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!521 = !DISubroutineType(types: !522)
!522 = !{!508, !212, !212}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !524, file: !366, line: 227)
!524 = !DISubprogram(name: "atoll", scope: !23, file: !23, line: 373, type: !525, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!525 = !DISubroutineType(types: !526)
!526 = !{!212, !267}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !528, file: !366, line: 228)
!528 = !DISubprogram(name: "strtoll", scope: !23, file: !23, line: 200, type: !529, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!529 = !DISubroutineType(types: !530)
!530 = !{!212, !455, !483, !7}
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !532, file: !366, line: 229)
!532 = !DISubprogram(name: "strtoull", scope: !23, file: !23, line: 205, type: !533, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!533 = !DISubroutineType(types: !534)
!534 = !{!535, !455, !483, !7}
!535 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !537, file: !366, line: 231)
!537 = !DISubprogram(name: "strtof", scope: !23, file: !23, line: 123, type: !538, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!538 = !DISubroutineType(types: !539)
!539 = !{!90, !455, !483}
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !507, entity: !541, file: !366, line: 232)
!541 = !DISubprogram(name: "strtold", scope: !23, file: !23, line: 126, type: !542, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!542 = !DISubroutineType(types: !543)
!543 = !{!101, !455, !483}
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !508, file: !366, line: 240)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !514, file: !366, line: 242)
!546 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !516, file: !366, line: 244)
!547 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !548, file: !366, line: 245)
!548 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !507, file: !366, line: 213, type: !521, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !520, file: !366, line: 246)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !524, file: !366, line: 248)
!551 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !537, file: !366, line: 249)
!552 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !528, file: !366, line: 250)
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !532, file: !366, line: 251)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !541, file: !366, line: 252)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !556, file: !571, line: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !557, line: 6, baseType: !558)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/mbstate_t.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !559, line: 21, baseType: !560)
!559 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__mbstate_t.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !559, line: 13, size: 64, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !561, identifier: "_ZTS11__mbstate_t")
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !560, file: !559, line: 15, baseType: !7, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !560, file: !559, line: 20, baseType: !564, size: 32, offset: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !560, file: !559, line: 16, size: 32, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !565, identifier: "_ZTSN11__mbstate_tUt_E")
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !564, file: !559, line: 18, baseType: !478, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !564, file: !559, line: 19, baseType: !568, size: 32)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 32, elements: !569)
!569 = !{!570}
!570 = !DISubrange(count: 4)
!571 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/7.3.0/../../../../include/c++/7.3.0/cwchar", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!572 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !573, file: !571, line: 139)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !574, line: 20, baseType: !478)
!574 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/wint_t.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!575 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !576, file: !571, line: 141)
!576 = !DISubprogram(name: "btowc", scope: !577, file: !577, line: 318, type: !578, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!577 = !DIFile(filename: "/usr/include/wchar.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!578 = !DISubroutineType(types: !579)
!579 = !{!573, !7}
!580 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !581, file: !571, line: 142)
!581 = !DISubprogram(name: "fgetwc", scope: !577, file: !577, line: 727, type: !582, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!582 = !DISubroutineType(types: !583)
!583 = !{!573, !584}
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !586, line: 5, baseType: !587)
!586 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__FILE.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !588, line: 245, size: 1728, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !589, identifier: "_ZTS8_IO_FILE")
!588 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/libio.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !605, !607, !608, !609, !612, !614, !616, !620, !623, !625, !626, !627, !628, !629, !630, !631}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !587, file: !588, line: 246, baseType: !7, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !587, file: !588, line: 251, baseType: !9, size: 64, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !587, file: !588, line: 252, baseType: !9, size: 64, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !587, file: !588, line: 253, baseType: !9, size: 64, offset: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !587, file: !588, line: 254, baseType: !9, size: 64, offset: 256)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !587, file: !588, line: 255, baseType: !9, size: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !587, file: !588, line: 256, baseType: !9, size: 64, offset: 384)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !587, file: !588, line: 257, baseType: !9, size: 64, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !587, file: !588, line: 258, baseType: !9, size: 64, offset: 512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !587, file: !588, line: 260, baseType: !9, size: 64, offset: 576)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !587, file: !588, line: 261, baseType: !9, size: 64, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !587, file: !588, line: 262, baseType: !9, size: 64, offset: 704)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !587, file: !588, line: 264, baseType: !603, size: 64, offset: 768)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !588, line: 160, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !587, file: !588, line: 266, baseType: !606, size: 64, offset: 832)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !587, file: !588, line: 268, baseType: !7, size: 32, offset: 896)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !587, file: !588, line: 272, baseType: !7, size: 32, offset: 928)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !587, file: !588, line: 274, baseType: !610, size: 64, offset: 960)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !611, line: 140, baseType: !16)
!611 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/mcopik/projects/ETH/extrap/llvm_pass/extrap-tool")
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !587, file: !588, line: 278, baseType: !613, size: 16, offset: 1024)
!613 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !587, file: !588, line: 279, baseType: !615, size: 8, offset: 1040)
!615 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !587, file: !588, line: 280, baseType: !617, size: 8, offset: 1048)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 8, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 1)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !587, file: !588, line: 284, baseType: !621, size: 64, offset: 1088)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !588, line: 154, baseType: null)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !587, file: !588, line: 293, baseType: !624, size: 64, offset: 1152)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !611, line: 141, baseType: !16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !587, file: !588, line: 301, baseType: !402, size: 64, offset: 1216)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !587, file: !588, line: 302, baseType: !402, size: 64, offset: 1280)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !587, file: !588, line: 303, baseType: !402, size: 64, offset: 1344)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !587, file: !588, line: 304, baseType: !402, size: 64, offset: 1408)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !587, file: !588, line: 306, baseType: !405, size: 64, offset: 1472)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !587, file: !588, line: 307, baseType: !7, size: 32, offset: 1536)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !587, file: !588, line: 309, baseType: !632, size: 160, offset: 1568)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 160, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 20)
!635 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !636, file: !571, line: 143)
!636 = !DISubprogram(name: "fgetws", scope: !577, file: !577, line: 756, type: !637, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!637 = !DISubroutineType(types: !638)
!638 = !{!453, !452, !7, !639}
!639 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !584)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !641, file: !571, line: 144)
!641 = !DISubprogram(name: "fputwc", scope: !577, file: !577, line: 741, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!642 = !DISubroutineType(types: !643)
!643 = !{!573, !454, !584}
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !645, file: !571, line: 145)
!645 = !DISubprogram(name: "fputws", scope: !577, file: !577, line: 763, type: !646, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!646 = !DISubroutineType(types: !647)
!647 = !{!7, !499, !639}
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !649, file: !571, line: 146)
!649 = !DISubprogram(name: "fwide", scope: !577, file: !577, line: 573, type: !650, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!650 = !DISubroutineType(types: !651)
!651 = !{!7, !584, !7}
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !653, file: !571, line: 147)
!653 = !DISubprogram(name: "fwprintf", scope: !577, file: !577, line: 580, type: !654, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!654 = !DISubroutineType(types: !655)
!655 = !{!7, !639, !499, null}
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !657, file: !571, line: 148)
!657 = !DISubprogram(name: "fwscanf", scope: !577, file: !577, line: 621, type: !654, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !659, file: !571, line: 149)
!659 = !DISubprogram(name: "getwc", scope: !577, file: !577, line: 728, type: !582, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !661, file: !571, line: 150)
!661 = !DISubprogram(name: "getwchar", scope: !577, file: !577, line: 734, type: !662, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!662 = !DISubroutineType(types: !663)
!663 = !{!573}
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !665, file: !571, line: 151)
!665 = !DISubprogram(name: "mbrlen", scope: !577, file: !577, line: 329, type: !666, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!666 = !DISubroutineType(types: !667)
!667 = !{!405, !455, !405, !668}
!668 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !671, file: !571, line: 152)
!671 = !DISubprogram(name: "mbrtowc", scope: !577, file: !577, line: 296, type: !672, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!672 = !DISubroutineType(types: !673)
!673 = !{!405, !452, !455, !405, !668}
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !675, file: !571, line: 153)
!675 = !DISubprogram(name: "mbsinit", scope: !577, file: !577, line: 292, type: !676, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!676 = !DISubroutineType(types: !677)
!677 = !{!7, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !681, file: !571, line: 154)
!681 = !DISubprogram(name: "mbsrtowcs", scope: !577, file: !577, line: 337, type: !682, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!682 = !DISubroutineType(types: !683)
!683 = !{!405, !452, !684, !405, !668}
!684 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !687, file: !571, line: 155)
!687 = !DISubprogram(name: "putwc", scope: !577, file: !577, line: 742, type: !642, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !689, file: !571, line: 156)
!689 = !DISubprogram(name: "putwchar", scope: !577, file: !577, line: 748, type: !690, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!690 = !DISubroutineType(types: !691)
!691 = !{!573, !454}
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !693, file: !571, line: 158)
!693 = !DISubprogram(name: "swprintf", scope: !577, file: !577, line: 590, type: !694, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!694 = !DISubroutineType(types: !695)
!695 = !{!7, !452, !405, !499, null}
!696 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !697, file: !571, line: 160)
!697 = !DISubprogram(name: "swscanf", scope: !577, file: !577, line: 631, type: !698, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!698 = !DISubroutineType(types: !699)
!699 = !{!7, !499, !499, null}
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !701, file: !571, line: 161)
!701 = !DISubprogram(name: "ungetwc", scope: !577, file: !577, line: 771, type: !702, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!702 = !DISubroutineType(types: !703)
!703 = !{!573, !573, !584}
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !705, file: !571, line: 162)
!705 = !DISubprogram(name: "vfwprintf", scope: !577, file: !577, line: 598, type: !706, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!706 = !DISubroutineType(types: !707)
!707 = !{!7, !639, !499, !708}
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, flags: DIFlagTypePassByValue | DIFlagTrivial, elements: !710, identifier: "_ZTS13__va_list_tag")
!710 = !{!711, !712, !713, !714}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !709, file: !3, baseType: !478, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !709, file: !3, baseType: !478, size: 32, offset: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !709, file: !3, baseType: !402, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !709, file: !3, baseType: !402, size: 64, offset: 128)
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !716, file: !571, line: 164)
!716 = !DISubprogram(name: "vfwscanf", scope: !577, file: !577, line: 673, type: !706, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !718, file: !571, line: 167)
!718 = !DISubprogram(name: "vswprintf", scope: !577, file: !577, line: 611, type: !719, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!719 = !DISubroutineType(types: !720)
!720 = !{!7, !452, !405, !499, !708}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !722, file: !571, line: 170)
!722 = !DISubprogram(name: "vswscanf", scope: !577, file: !577, line: 685, type: !723, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!723 = !DISubroutineType(types: !724)
!724 = !{!7, !499, !499, !708}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !726, file: !571, line: 172)
!726 = !DISubprogram(name: "vwprintf", scope: !577, file: !577, line: 606, type: !727, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!727 = !DISubroutineType(types: !728)
!728 = !{!7, !499, !708}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !730, file: !571, line: 174)
!730 = !DISubprogram(name: "vwscanf", scope: !577, file: !577, line: 681, type: !727, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !732, file: !571, line: 176)
!732 = !DISubprogram(name: "wcrtomb", scope: !577, file: !577, line: 301, type: !733, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!733 = !DISubroutineType(types: !734)
!734 = !{!405, !498, !454, !668}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !736, file: !571, line: 177)
!736 = !DISubprogram(name: "wcscat", scope: !577, file: !577, line: 97, type: !737, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!737 = !DISubroutineType(types: !738)
!738 = !{!453, !452, !499}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !740, file: !571, line: 178)
!740 = !DISubprogram(name: "wcscmp", scope: !577, file: !577, line: 106, type: !741, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!741 = !DISubroutineType(types: !742)
!742 = !{!7, !500, !500}
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !744, file: !571, line: 179)
!744 = !DISubprogram(name: "wcscoll", scope: !577, file: !577, line: 131, type: !741, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !746, file: !571, line: 180)
!746 = !DISubprogram(name: "wcscpy", scope: !577, file: !577, line: 87, type: !737, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !748, file: !571, line: 181)
!748 = !DISubprogram(name: "wcscspn", scope: !577, file: !577, line: 187, type: !749, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!749 = !DISubroutineType(types: !750)
!750 = !{!405, !500, !500}
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !13, entity: !752, file: !571, line: 182)
!752 = !DISubprogram(name: "wcsftime", scope: !577, file: !577, line: 835, type: !753, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: true)
!753 = !DISubroutineType(types: !754)
!754 = !{!405, !452, !405, !499, !755}
